
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/22035348744)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * proxmox_vm_qemu.domain_controller[&#34;01&#34;]
* Replace
  * terraform_data.cloud_init_config__domain_controller[&#34;01&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # proxmox_vm_qemu.domain_controller["01"] will be created
  + resource "proxmox_vm_qemu" "domain_controller" {
      + additional_wait           = 5
      + agent                     = 1
      + agent_timeout             = 90
      + automatic_reboot          = true
      + automatic_reboot_severity = "error"
      + balloon                   = 0
      + bios                      = "ovmf"
      + boot                      = (known after apply)
      + bootdisk                  = (known after apply)
      + cicustom                  = "user=local:snippets/prod-adds-01_cloud-init.yaml"
      + ciupgrade                 = false
      + clone                     = "winsrv-2025"
      + clone_wait                = 10
      + current_node              = (known after apply)
      + default_ipv4_address      = (known after apply)
      + default_ipv6_address      = (known after apply)
      + define_connection_info    = true
      + description               = "Active Directory domain contoller. This VM is managed by Terraform."
      + force_create              = false
      + full_clone                = true
      + hotplug                   = "network,disk,usb,memory,cpu"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=192.168.21.10/24,gw=192.168.21.1"
      + kvm                       = true
      + linked_vmid               = (known after apply)
      + memory                    = 4096
      + name                      = "prod-adds-01"
      + os_type                   = "cloud-init"
      + protection                = false
      + qemu_os                   = "win11"
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-single"
      + skip_ipv4                 = false
      + skip_ipv6                 = false
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + start_at_node_boot        = true
      + tablet                    = true
      + tags                      = "prod;terraform;domain-controller"
      + target_node               = "prod-prox-01"
      + unused_disk               = (known after apply)
      + vm_state                  = "running"
      + vmid                      = 106

      + cpu {
          + cores   = 2
          + limit   = 0
          + numa    = true
          + sockets = 1
          + type    = "x86-64-v3"
          + units   = 0
          + vcores  = 0
        }

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "40G"
                      + storage              = "local-lvm"
                    }
                }
              + scsi1 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "15G"
                      + storage              = "local-lvm"
                    }
                }
              + scsi2 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + smbios (known after apply)

      + startup_shutdown {
          + order            = 1
          + shutdown_timeout = -1
          + startup_delay    = -1
        }

      + tpm_state {
          + storage = "local-lvm"
          + version = "v2.0"
        }

      + vga {
          + type = "std"
        }
    }

  # terraform_data.cloud_init_config__domain_controller["01"] must be replaced
-/+ resource "terraform_data" "cloud_init_config__domain_controller" {
      ~ id               = "5c3df253-67b5-85d9-d9b7-5fc2489217b8" -> (known after apply)
      ~ triggers_replace = [
          ~ "47a0bdcd1cdff82c3bed7a16a96662f9335e5af8" -> "d3a41d450fa6d73b03ae16e9faae9bc68a27a99a",
            {
                bcrypt_hash      = (sensitive value)
                id               = "none"
                keepers          = null
                length           = 20
                lower            = true
                min_lower        = 3
                min_numeric      = 3
                min_special      = 0
                min_upper        = 3
                number           = true
                numeric          = true
                override_special = null
                result           = (sensitive value)
                special          = false
                upper            = true
            },
            # (1 unchanged element hidden)
        ]
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":286,"Program":"tfcmt","SHA1":"c97a9690c30506b7df7a4a93e60ee43661b7903c","Vars":{},"WorkflowName":"Terraform CI"} -->